In [1]:
import os
import pandas as pd
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [62]:

url_base = 'postgresql://postgres:postgres@172.18.160.1:5432/heroku'
url_base = 'postgres://qatbxyntzlknkz:ab06e8722668e01b3e8adc17e6f13153602293a7e973411a65f27e0435ff1a4e@ec2-23-20-124-77.compute-1.amazonaws.com:5432/d6nt7q88h8t02j'
print(url_base)
engine = create_engine(url_base)

postgresql://postgres:postgres@172.18.160.1:5432/heroku

In [43]:
querystring="""select extract(year from usage_timestamp) as usage_year, genero_usuario, count(genero_usuario) as users from viajes
                    group by usage_year,genero_usuario
                    order by usage_year"""
yearlyByGender = pd.read_sql(querystring,engine)
yearlyByGender = yearlyByGender.rename(columns={'usage_year':'Year','genero_usuario':'Gender','users':'Count'})
yearlyByGender.to_sql('yearlybygender',engine,if_exists='replace')
pd.read_sql("select * from yearlybygender",engine).head()

   index    Year Gender  Count
0      0  2010.0      M   6132
1      1  2010.0      F   2279
2      2  2011.0      F   6854
3      3  2011.0      M  18575
4      4  2012.0      F   7779

In [40]:

monthlyEveryYear ={}
for i in range(12):
    querystring=f"""select extract(month from usage_timestamp)  as usage_month,  genero_usuario, count(genero_usuario) as users from viajes
                    where usage_timestamp >= '{2010+i}-01-01' and usage_timestamp < '{2011+i}-01-01'
                    group by usage_month,genero_usuario
                    order by usage_month"""
    
    monthlyEveryYear[str(2010+i)] = pd.read_sql(querystring,engine)
    monthlyEveryYear[str(2010+i)] = monthlyEveryYear[str(2010+i)].rename(columns={'usage_month':'Month','genero_usuario':'Gender','users':'Count'})
monthlyByGender = pd.concat(monthlyEveryYear)
monthlyByGender.to_sql('monthlybygender',engine,if_exists='replace')
pd.read_sql("select * from monthlybygender",engine).head()

  level_0  level_1  Month Gender  Count
0    2010        0    2.0      F      2
1    2010        1    2.0      M      9
2    2010        2    3.0      F     44
3    2010        3    3.0      M    166
4    2010        4    4.0      F    122

In [41]:
yeardata = 2011
querystring=f"""select * from monthlybygender
                where level_0 = '{yeardata}'"""
pd.read_sql(querystring,engine).head()

  level_0  level_1  Month Gender  Count
0    2011        0    1.0      M   1437
1    2011        1    1.0      F    504
2    2011        2    2.0      F    575
3    2011        3    2.0      M   1559
4    2011        4    3.0      M   1941

In [47]:
querystring="""select (case when edad_usuario >= 10 and edad_usuario < 20 then '10-19'
             when edad_usuario >= 20 and edad_usuario < 30 then '20-29'
             when edad_usuario >= 30 and edad_usuario < 40 then '30-39'
             when edad_usuario >= 40 and edad_usuario < 50 then '40-49'
             when edad_usuario >= 50 and edad_usuario < 60 then '50-59'
             when edad_usuario >= 60 and edad_usuario < 70 then '60-69'
             when edad_usuario >= 70 and edad_usuario < 80 then '70-79'
	         when edad_usuario >= 80 and edad_usuario < 90 then '80-89'
             else 'other' end) as range, count(*) as user_counts, genero_usuario
            from viajes
            group by genero_usuario, (case when edad_usuario >= 10 and edad_usuario < 20 then '10-19'
             when edad_usuario >= 20 and edad_usuario < 30 then '20-29'
             when edad_usuario >= 30 and edad_usuario < 40 then '30-39'
             when edad_usuario >= 40 and edad_usuario < 50 then '40-49'
             when edad_usuario >= 50 and edad_usuario < 60 then '50-59'
             when edad_usuario >= 60 and edad_usuario < 70 then '60-69'
             when edad_usuario >= 70 and edad_usuario < 80 then '70-79'
	         when edad_usuario >= 80 and edad_usuario < 90 then '80-89'
             else 'other' end);"""
demoRange = pd.read_sql(querystring,engine)
demoRange = demoRange.rename(columns={'range':'Range','genero_usuario':'Gender','user_counts':'Count'})
demoRange.to_sql('demorange',engine,if_exists='replace')
pd.read_sql("select * from demorange",engine).head()

   index  Range  Count Gender
0      0  10-19   2248      F
1      1  20-29  80055      F
2      2  30-39  65371      F
3      3  40-49  21985      F
4      4  50-59  11538      F

In [49]:
querystring="""select edad_usuario ,count(*) as user_counts from viajes
            group by edad_usuario"""
demoAge = pd.read_sql(querystring,engine)
demoAge = demoAge.rename(columns={'edad_usuario':'Age','user_counts':'Count'})
demoAge.to_sql('demoage',engine,if_exists='replace')
pd.read_sql("select * from demoage",engine).head()

   index  Age  Count
0      0   16    543
1      1   17   1114
2      2   18   2459
3      3   19   4524
4      4   20   6383

In [64]:

routesByYear ={}
for i in range(12):
    querystring=f"""Select v.ciclo_estacion_retiro, v.ciclo_estacion_arribo, count(v.ciclo_estacion_arribo) as trips,
                    er.LAT as retiro_lat,er.LON as retiro_lon,
                    ea.LAT as arribo_lat, ea.LON as arribo_lon 
                    from Viajes v                   
                    left join Estaciones er
                    on v.ciclo_estacion_retiro=er.E_ID
                    left join Estaciones ea
                    on v.ciclo_estacion_arribo=ea.E_ID
					where usage_timestamp >= '{2010+i}-01-01' and usage_timestamp < '{2011+i}-01-01'
                    group by v.ciclo_estacion_retiro,v.ciclo_estacion_arribo,retiro_lat,retiro_lon,
                    arribo_lat,arribo_lon 
                    order by trips desc
                    limit 250;"""
    routesByYear[str(2010+i)] = pd.read_sql(querystring,engine)
    routesByYear[str(2010+i)] = routesByYear[str(2010+i)].rename(columns={'usage_month':'Month','genero_usuario':'Gender','users':'Count'})
routes = pd.concat(routesByYear)
print(routesByYear)
routes.to_sql('routesbyyear',engine,if_exists='replace')
pd.read_sql("select * from routesbyyear",engine).head()

{'2010':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                       61                     61     25   19.413742
1                       85                     85     24   19.434250
2                       70                     70     22   19.411272
3                       13                     20     18   19.425020
4                       20                     13     17   19.430964
..                     ...                    ...    ...         ...
245                     71                     80      6   19.411423
246                     41                     51      6   19.435637
247                      1                     10      6   19.433571
248                     70                     67      6   19.411272
249                      6                     27      6   19.430922

     retiro_lon  arribo_lat  arribo_lon
0    -99.169525   19.413742  -99.169525
1    -99.162508   19.434250  -99.162508
2    -99.169718   19.411272  -99.169718
3    -99.172310   19.430964  -99.160206
4    -99.160206   19.425020  -99.172310
..          ...         ...         ...
245  -99.171351   19.407307  -99.172118
246  -99.150137   19.417995  -99.168248
247  -99.167809   19.433321  -99.154752
248  -99.169718   19.411797  -99.175880
249  -99.166959   19.429115  -99.162614

[250 rows x 7 columns], '2011':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                       61                     61     52   19.413742
1                       70                     70     45   19.411272
2                       41                      3     41   19.435637
3                       18                      1     40   19.428880
4                       16                     13     38   19.427226
..                     ...                    ...    ...         ...
245                     17                     27     14   19.427501
246                      9                      2     14   19.428009
247                     66                     53     14   19.411402
248                     13                     18     14   19.425020
249                     29                      3     14   19.434913

     retiro_lon  arribo_lat  arribo_lon
0    -99.169525   19.413742  -99.169525
1    -99.169718   19.411272  -99.169718
2    -99.150137   19.431655  -99.158668
3    -99.164176   19.433571  -99.167809
4    -99.168242   19.425020  -99.172310
..          ...         ...         ...
245  -99.167125   19.429115  -99.162614
246  -99.169918   19.431386  -99.171695
247  -99.178666   19.414773  -99.178433
248  -99.172310   19.428880  -99.164176
249  -99.149939   19.431655  -99.158668

[250 rows x 7 columns], '2012':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                        1                     18     65   19.433571
1                       18                      1     43   19.428880
2                       41                      3     41   19.435637
3                       85                     85     41   19.434250
4                        1                     27     41   19.433571
..                     ...                    ...    ...         ...
245                     79                     84     13   19.407534
246                     56                     38     13   19.416959
247                     54                     38     13   19.416215
248                     71                     66     13   19.411423
249                     64                     61     13   19.412877

     retiro_lon  arribo_lat  arribo_lon
0    -99.167809   19.428880  -99.164176
1    -99.164176   19.433571  -99.167809
2    -99.150137   19.431655  -99.158668
3    -99.162508   19.434250  -99.162508
4    -99.167809   19.429115  -99.162614
..          ...         ...         ...
245  -99.174427   19.407020  -99.169587
246  -99.165702   19.420801  -99.171407
247  -99.170825   19.420801  -99.171407
248  -99.171351   19.411402  -99.178666
249  -99.166986   19.413742  -99.169525

[250 rows x 7 columns], '2013':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                       41                      3     58   19.435637
1                      211                    217     51   19.433607
2                       53                     36     50   19.414773
3                       18                      1     49   19.428880
4                       61                     61     47   19.413742
..                     ...                    ...    ...         ...
245                     16                     13     16   19.427226
246                     38                     45     16   19.420801
247                     49                     72     16   19.416712
248                     36                     74     16   19.419725
249                    154                    150     16   19.406683

     retiro_lon  arribo_lat  arribo_lon
0    -99.150137   19.431655  -99.158668
1    -99.188528   19.432888  -99.183605
2    -99.178433   19.419725  -99.175778
3    -99.164176   19.433571  -99.167809
4    -99.169525   19.413742  -99.169525
..          ...         ...         ...
245  -99.168242   19.425020  -99.172310
246  -99.171407   19.418649  -99.172127
247  -99.175704   19.409893  -99.179544
248  -99.175778   19.410343  -99.172831
249  -99.167962   19.409965  -99.164292

[250 rows x 7 columns], '2014':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                       41                      3     63   19.435637
1                      183                    174     63   19.437670
2                      211                    217     60   19.433607
3                       21                     27     53   19.424720
4                        1                     18     49   19.433571
..                     ...                    ...    ...         ...
245                     80                     74     18   19.407307
246                      2                      2     18   19.431386
247                     19                     43     18   19.429241
248                     36                     58     18   19.419725
249                     10                     19     18   19.433321

     retiro_lon  arribo_lat  arribo_lon
0    -99.150137   19.431655  -99.158668
1    -99.164020   19.441110  -99.161640
2    -99.188528   19.432888  -99.183605
3    -99.172060   19.429115  -99.162614
4    -99.167809   19.428880  -99.164176
..          ...         ...         ...
245  -99.172118   19.410343  -99.172831
246  -99.171695   19.431386  -99.171695
247  -99.163377   19.435228  -99.146063
248  -99.175778   19.415680  -99.171793
249  -99.154752   19.429241  -99.163377

[250 rows x 7 columns], '2015':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                      211                    217     75   19.433607
1                       18                      1     71   19.428880
2                      174                    183     66   19.441110
3                      183                    174     62   19.437670
4                      108                    113     46   19.427305
..                     ...                    ...    ...         ...
245                    164                    163     17   19.403204
246                     18                     13     17   19.428880
247                      1                     11     17   19.433571
248                    208                    198     17   19.434182
249                     56                    135     17   19.416959

     retiro_lon  arribo_lat  arribo_lon
0    -99.188528   19.432888  -99.183605
1    -99.164176   19.433571  -99.167809
2    -99.161640   19.437670  -99.164020
3    -99.164020   19.441110  -99.161640
4    -99.149533   19.430369  -99.154419
..          ...         ...         ...
245  -99.165960   19.405246  -99.156431
246  -99.164176   19.425020  -99.172310
247  -99.167809   19.430992  -99.163593
248  -99.189835   19.438168  -99.203888
249  -99.165702   19.419225  -99.155099

[250 rows x 7 columns], '2016':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                      211                    217     72   19.433607
1                      174                    183     58   19.441110
2                      174                    257     51   19.441110
3                      183                    174     48   19.437670
4                      217                    211     47   19.432888
..                     ...                    ...    ...         ...
245                     54                     38     15   19.416215
246                    236                    238     15   19.429440
247                     36                     60     15   19.419725
248                     84                     64     15   19.407020
249                     53                     53     15   19.414773

     retiro_lon  arribo_lat  arribo_lon
0    -99.188528   19.432888  -99.183605
1    -99.161640   19.437670  -99.164020
2    -99.161640   19.433800  -99.166220
3    -99.164020   19.441110  -99.161640
4    -99.183605   19.433607  -99.188528
..          ...         ...         ...
245  -99.170825   19.420801  -99.171407
246  -99.202430   19.426765  -99.193752
247  -99.175778   19.414191  -99.177123
248  -99.169587   19.412877  -99.166986
249  -99.178433   19.414773  -99.178433

[250 rows x 7 columns], '2017':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                       18                      1     58   19.428880
1                      217                    211     52   19.432888
2                       85                    174     52   19.434250
3                      211                    217     51   19.433607
4                      151                    158     44   19.410529
..                     ...                    ...    ...         ...
245                     40                     47     16   19.422230
246                    206                    210     16   19.435798
247                    266                    270     16   19.444031
248                    206                    217     16   19.435798
249                    190                    189     16   19.409569

     retiro_lon  arribo_lat  arribo_lon
0    -99.164176   19.433571  -99.167809
1    -99.183605   19.433607  -99.188528
2    -99.162508   19.441110  -99.161640
3    -99.188528   19.432888  -99.183605
4    -99.160873   19.407447  -99.155717
..          ...         ...         ...
245  -99.164297   19.419515  -99.166299
246  -99.201419   19.434076  -99.194091
247  -99.152187   19.436760  -99.153870
248  -99.201419   19.432888  -99.183605
249  -99.183833   19.410040  -99.187980

[250 rows x 7 columns], '2018':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                      211                    217     53   19.433607
1                        1                     18     51   19.433571
2                       18                      1     48   19.428880
3                      107                    113     47   19.427329
4                      111                    174     42   19.438237
..                     ...                    ...    ...         ...
245                    182                     63     14   19.402089
246                     45                     45     14   19.418649
247                    134                    134     14   19.418304
248                     27                     17     14   19.429115
249                    246                    211     14   19.434147

     retiro_lon  arribo_lat  arribo_lon
0    -99.188528   19.432888  -99.183605
1    -99.167809   19.428880  -99.164176
2    -99.164176   19.433571  -99.167809
3    -99.149971   19.430369  -99.154419
4    -99.165947   19.441110  -99.161640
..          ...         ...         ...
245  -99.171390   19.413681  -99.171531
246  -99.172127   19.418649  -99.172127
247  -99.159560   19.418304  -99.159560
248  -99.162614   19.427501  -99.167125
249  -99.179835   19.433607  -99.188528

[250 rows x 7 columns], '2019':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                      174                    183     53   19.441110
1                      174                    111     49   19.441110
2                      211                    217     48   19.433607
3                        1                     18     48   19.433571
4                      270                    266     40   19.436760
..                     ...                    ...    ...         ...
245                    135                     56     14   19.419225
246                     28                    267     14   19.423542
247                     23                    271     14   19.425170
248                    133                    136     14   19.421138
249                    257                    160     14   19.433800

     retiro_lon  arribo_lat  arribo_lon
0    -99.161640   19.437670  -99.164020
1    -99.161640   19.438237  -99.165947
2    -99.188528   19.432888  -99.183605
3    -99.167809   19.428880  -99.164176
4    -99.153870   19.444031  -99.152187
..          ...         ...         ...
245  -99.155099   19.416959  -99.165702
246  -99.172494   19.443735  -99.152203
247  -99.171050   19.443928  -99.152525
248  -99.154725   19.417715  -99.162729
249  -99.166220   19.440250  -99.163460

[250 rows x 7 columns], '2020':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                       27                     27     28   19.429115
1                       34                     34     26   19.424725
2                       18                      1     25   19.428880
3                       33                     33     24   19.424234
4                      139                    139     23   19.416128
..                     ...                    ...    ...         ...
245                      1                      9      7   19.433571
246                    120                    120      7   19.425437
247                    185                    186      7   19.412800
248                    108                    139      7   19.427305
249                    185                    191      7   19.412800

     retiro_lon  arribo_lat  arribo_lon
0    -99.162614   19.429115  -99.162614
1    -99.163331   19.424725  -99.163331
2    -99.164176   19.433571  -99.167809
3    -99.166431   19.424234  -99.166431
4    -99.162097   19.416128  -99.162097
..          ...         ...         ...
245  -99.167809   19.428009  -99.169918
246  -99.159458   19.425437  -99.159458
247  -99.182800   19.412429  -99.188512
248  -99.149533   19.416128  -99.162097
249  -99.182800   19.407900  -99.187950

[250 rows x 7 columns], '2021':      ciclo_estacion_retiro  ciclo_estacion_arribo  trips  retiro_lat  \
0                      391                    391     39   19.373142
1                      151                    151     12   19.410529
2                      426                    426     12   19.365519
3                       11                     11     11   19.430992
4                      327                    327     11   19.388850
..                     ...                    ...    ...         ...
245                    141                    126      3   19.415905
246                     48                    100      3   19.433686
247                     76                     36      3   19.408736
248                    285                    305      3   19.399795
249                     64                     38      3   19.412877

     retiro_lon  arribo_lat  arribo_lon
0    -99.178283   19.373142  -99.178283
1    -99.160873   19.410529  -99.160873
2    -99.166017   19.365519  -99.166017
3    -99.163593   19.430992  -99.163593
4    -99.177720   19.388850  -99.177720
..          ...         ...         ...
245  -99.159540   19.422288  -99.162138
246  -99.146557   19.428485  -99.133800
247  -99.169913   19.419725  -99.175778
248  -99.177518   19.394693  -99.175531
249  -99.166986   19.420801  -99.171407

[250 rows x 7 columns]}

,level_0,level_1,ciclo_estacion_retiro,ciclo_estacion_arribo,trips,retiro_lat,retiro_lon,arribo_lat,arribo_lon
0,2010,0,61,61,25,19.413742,-99.169525,19.413742,-99.169525
1,2010,1,85,85,24,19.434250,-99.162508,19.434250,-99.162508
2,2010,2,70,70,22,19.411272,-99.169718,19.411272,-99.169718
3,2010,3,13,20,18,19.425020,-99.172310,19.430964,-99.160206
4,2010,4,20,13,17,19.430964,-99.160206,19.425020,-99.172310

In [66]:
pd.read_sql("select * from colonias",engine)

,ID,NAME,GeoShape,Alcaldia
0,0,LOMAS DE CHAPULTEPEC,"[[19.428032506497445, -99.22017088373187], [19...",MIGUEL HIDALGO
1,1,LOMAS DE REFORMA (LOMAS DE CHAPULTEPEC),"[[19.4140557307484, -99.22967474076427], [19.4...",MIGUEL HIDALGO
2,2,DEL BOSQUE (POLANCO),"[[19.432815650005196, -99.2082100184801], [19....",MIGUEL HIDALGO
3,3,PEDREGAL DE SANTA URSULA I,"[[19.319786927215006, -99.14587387461441], [19...",COYOACAN
4,4,AJUSCO I,"[[19.330376399703336, -99.15854038211513], [19...",COYOACAN
...,...,...,...,...
1799,1796,SANTA URSULA COAPA (PBLO),"[[19.30387499587913, -99.14770054905674], [19....",COYOACAN
1800,1800,AVIACION CIVIL,"[[19.411363516628217, -99.08101431442913], [19...",VENUSTIANO CARRANZA
1801,1801,TAXQUEA,"[[19.340946565372356, -99.12370923826415], [19...",COYOACAN
1802,1802,EX EJIDO SAN FRANCISCO CULHUACAN III,"[[19.332091187760017, -99.12372138614238], [19...",COYOACAN
1803,1803,JARDIN BALBUENA I,"[[19.42423574988566, -99.11181641095084], [19....",VENUSTIANO CARRANZA